Tekla Open API Reference for Tekla Structures 2025
CylindricalSurface Constructor (Vector, Vector, LineSegment, LineSegment)
 Initializes a new instance of the CylindricalSurface class with given parameters. The boundaries are defined by the side boundaries (i.e. generator lines of the cylinder).
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CylindricalSurface(
	Vector endFaceNormal1,
	Vector endFaceNormal2,
	LineSegment sideBoundary1,
	LineSegment sideBoundary2
)
Public Sub New (
	endFaceNormal1 As Vector,
	endFaceNormal2 As Vector,
	sideBoundary1 As LineSegment,
	sideBoundary2 As LineSegment
)
Parameters
endFaceNormal1
Type: Tekla.Structures.Geometry3d.Vector
The first end face normal.
endFaceNormal2
Type: Tekla.Structures.Geometry3d.Vector
The second end face normal.
sideBoundary1
Type: Tekla.Structures.Geometry3d.LineSegment
The first side boundary.
sideBoundary2
Type: Tekla.Structures.Geometry3d.LineSegment
The second side boundary.
Exceptions
Exception | Condition
ArgumentNullException | Throws exception if one of the arguments has null value.
Remarks
This constructor may be numerically instable if the end faces are very close
See Also
Reference
CylindricalSurface Class
CylindricalSurface Overload
Tekla.Structures.Model Namespace